wip: actualiza y reorganiza documentacion
